{
  "title": "Four Stir Fry Dishes to Try",
  "publishedAt": "8th May 2020",
  "content": "Why order just one type of stir fry when you can try four? The Chinese cooking technique that mixes sauce, crisp veggies and tender meat over a high heat playfully combines flavor and texture for a gusto-packed meal. Unlike sautéing or pan frying, a good stir fry dish is dependent on a high level of heat at the center of the pan, rapid agitation of the ingredients, and a small amount of fat. This ensures the food is both crisp and tender. Stir fry has been an Asian cooking technique for ages, but the phrase first appeared in English in 1945. And since it refers to the technique and not the flavors, you can really make this dish your own. Customize or stick to a classic — order one of these to-die-for variations today.\n\n![Foo](https://images.unsplash.com/photo-1516684465974-78661ba8165d?auto=format&fit=crop&w=500&h=400&q=80)\n\n## **Teriyaki Chicken**\n\nAn amalgamation of cultures and cuisines, teriyaki chicken stir fry is a popular choice for those with simpler palates and adventurous eaters, alike. Popular across the country, but particularly in Seattle, teriyaki is actually rumored to have originated in Hawaii. Although this dish is likely distinctly American, it does have Japanese roots. “Teri” means “glazed,” and “yaki” is interpreted to mean “grilled” in Japanese.\n\n![Foo](https://images.unsplash.com/photo-1547120271-26087f8fb804?auto=format&fit=crop&w=500&h=400&q=80)\n\n## **Beef with Scallions**\n\nA classic Chinese combination, beef with scallions is a delicious stir fry dish. The technique of cutting the beef into bite-sized pieces before stir frying tenderizes the meat, and the concentration of high heat at the center of the pan gets it nice and crispy. With scallions that are blistered to perfection and a rich, salty hoisin-based sauce, beef with scallions is delicious over rice.\n\n![Foo](https://images.unsplash.com/photo-1546069901-ba9599a7e63c?auto=format&fit=crop&w=500&h=400&q=80)\n\n## **Tofu and Veggies**\n\nLooking to get a protein-packed dish without animal products? A tofu and veggie stir fry delivers both health benefits and flavor. The wok gives an extra firm piece of tofu a golden sear, making it the perfect vessel for a soy-based sauce. Tossed with green beans, red peppers, carrots, broccoli, mushrooms — maybe even baby corn — the crisp veggies pack an explosion of yum. This dish will be sure to leave you both satiated and smiling.\n\n![Foo](https://images.unsplash.com/photo-1568254500745-c879851c30fe?auto=format&fit=crop&w=500&h=400&q=80)\n\n## **Spicy Sichuan Shrimp**\n\nIf you’re ready to turn up the heat, look to the Sichuan province for a distinct flavor of cooking that incorporates chili peppers, a liberal use of garlic and uniquely pungent Sichuan peppercorns. The combination of spices and the cooking technique brings out the flavor of the shrimp, making it an instant crowd-pleaser. Serve this hot dish over rice or noodles to balance the heat."
}